In [1]:
import requests
from bs4 import BeautifulSoup
import pandas as pd

In [2]:
url = "https://statbase.org/datasets/tourism-and-leisure/theme-parks-attendance/?syear=2023&frmreq=0&sproc=proc&filter=&sort="
resp = requests.get(url)
resp.raise_for_status()  # para asegurarnos de que la petición fue exitosa
html = resp.text

In [3]:
soup = BeautifulSoup(html, "html.parser")

# Supongamos que los datos están en un <table>…
table = soup.find("table")
soup = BeautifulSoup(resp.text, "html.parser")

In [4]:
rows = soup.find_all("div", class_="it_row")
all_data = []
for row in rows:
    # dentro de la fila, buscar todas las “celdas”
    cells = row.find_all("div", class_="it_cell")
    row_vals = []
    for c in cells:
        text = c.get_text(strip=True)
        row_vals.append(text)
    all_data.append(row_vals)

# Convertir a dataframe
asistencia_parques = pd.DataFrame(all_data)
print(asistencia_parques.head())

                                                   0         1     2
0                                             Object  share, %  Rank
1  MAGIC KINGDOM THEME PARK AT WALT DISNEY WORLD ...      4.79     1
2      DISNEYLAND PARK AT DISNEYLAND RESORT, ANAHEIM      4.66     2
3                     UNIVERSAL STUDIOS JAPAN, OSAKA      4.33     3
4     TOKYO DISNEYLAND AT TOKYO DISNEY RESORT, TOKYO      4.08     4

In [5]:
asistencia_parques

                                                    0         1     2
0                                              Object  share, %  Rank
1   MAGIC KINGDOM THEME PARK AT WALT DISNEY WORLD ...      4.79     1
2       DISNEYLAND PARK AT DISNEYLAND RESORT, ANAHEIM      4.66     2
3                      UNIVERSAL STUDIOS JAPAN, OSAKA      4.33     3
4      TOKYO DISNEYLAND AT TOKYO DISNEY RESORT, TOKYO      4.08     4
..                                                ...       ...   ...
66                           FANTASIALANDIA, SANTIAGO      0.26    63
67                       MUNDO PETAPA, GUATEMALA CITY      0.25    64
68            THEME PARQUE NACIONAL DEL CAFÉ, QUINDIO      0.23    65
69                   PARQUE DE LA COSTA, BUENOS AIRES      0.17    66
70                          EL SALITRE MAGICO, BOGOTÁ      0.16    67

[71 rows x 3 columns]

In [6]:
asistencia_parques.columns = ['Nombre del Parque', 'share, %', "Rank"]

In [7]:
response = requests.get(url)
soup = BeautifulSoup(response.content, 'html.parser')

# Encontrar las filas de la tabla
rows = soup.find_all('div', class_='it_row')

# Inicializar listas para almacenar los datos
parques = []
ubicaciones = []
for row in rows:
    # Extraer la primera celda que contiene el nombre y ubicación
    cell = row.find('div', class_='it_cell')
    if cell:
        # Obtener el texto de la celda
        texto = cell.get_text(strip=True)
        # Separar el nombre del parque y la ubicación por la coma
        if ',' in texto:
            nombre_parque, ubicacion = texto.rsplit(',', 1)
            parques.append(nombre_parque.strip())
            ubicaciones.append(ubicacion.strip())
        else:
            parques.append(texto)
            ubicaciones.append('Desconocido')

# Crear un DataFrame con los datos
ubicaciones = pd.DataFrame({
    'Nombre del Parque': parques,
    'Ubicación (País)': ubicaciones
})

In [8]:
asistencia_parques

                                    Nombre del Parque  share, %  Rank
0                                              Object  share, %  Rank
1   MAGIC KINGDOM THEME PARK AT WALT DISNEY WORLD ...      4.79     1
2       DISNEYLAND PARK AT DISNEYLAND RESORT, ANAHEIM      4.66     2
3                      UNIVERSAL STUDIOS JAPAN, OSAKA      4.33     3
4      TOKYO DISNEYLAND AT TOKYO DISNEY RESORT, TOKYO      4.08     4
..                                                ...       ...   ...
66                           FANTASIALANDIA, SANTIAGO      0.26    63
67                       MUNDO PETAPA, GUATEMALA CITY      0.25    64
68            THEME PARQUE NACIONAL DEL CAFÉ, QUINDIO      0.23    65
69                   PARQUE DE LA COSTA, BUENOS AIRES      0.17    66
70                          EL SALITRE MAGICO, BOGOTÁ      0.16    67

[71 rows x 3 columns]

In [9]:
import requests
from bs4 import BeautifulSoup
import pandas as pd

In [10]:
# URL de la página con los datos
url = 'https://statbase.org/datasets/tourism-and-leisure/theme-parks-attendance/'

# Realizar la solicitud HTTP
response = requests.get(url)
soup = BeautifulSoup(response.content, 'html.parser')

# Encontrar las filas de la tabla
rows = soup.find_all('div', class_='it_row')

# Inicializar listas para almacenar los datos
parques = []
ubicaciones = []

# Iterar sobre cada fila para extraer los datos
for row in rows:
    # Extraer la primera celda que contiene el nombre y ubicación
    cell = row.find('div', class_='it_cell')
    if cell:
        # Obtener el texto de la celda
        texto = cell.get_text(strip=True)
        # Separar el nombre del parque y la ubicación por la coma
        if ',' in texto:
            nombre_parque, ubicacion = texto.rsplit(',', 1)
            parques.append(nombre_parque.strip())
            ubicaciones.append(ubicacion.strip())
        else:
            parques.append(texto)
            ubicaciones.append('Desconocido')

# Crear un DataFrame con los datos
ubicaciones = pd.DataFrame({
    'Nombre del Parque': parques,
    'Ubicación (País)': ubicaciones
})

In [11]:
ubicaciones

                                    Nombre del Parque  Ubicación (País)
0                                              Object       Desconocido
1   MAGIC KINGDOM THEME PARK AT WALT DISNEY WORLD ...  LAKE BUENA VISTA
2                DISNEYLAND PARK AT DISNEYLAND RESORT           ANAHEIM
3                             UNIVERSAL STUDIOS JAPAN             OSAKA
4             TOKYO DISNEYLAND AT TOKYO DISNEY RESORT             TOKYO
..                                                ...               ...
66                                     FANTASIALANDIA          SANTIAGO
67                                       MUNDO PETAPA    GUATEMALA CITY
68                     THEME PARQUE NACIONAL DEL CAFÉ           QUINDIO
69                                 PARQUE DE LA COSTA      BUENOS AIRES
70                                  EL SALITRE MAGICO            BOGOTÁ

[71 rows x 2 columns]

In [12]:
ubicaciones['Nombre del Parque'] = ubicaciones['Nombre del Parque'].str.strip().str.lower()
asistencia_parques['Nombre del Parque'] = asistencia_parques['Nombre del Parque'].str.strip().str.lower()

In [13]:
parques = pd.merge(
    ubicaciones,
    asistencia_parques,
    on='Nombre del Parque',
    how='outer'
)

In [14]:
parques

                            Nombre del Parque Ubicación (País) share, % Rank
0                                alton towers    STAFFORDSHIRE      NaN  NaN
1                 alton towers, staffordshire              NaN     0.64   50
2                          beto carrero world   SANTA CATARINA      NaN  NaN
3          beto carrero world, santa catarina              NaN     0.75   47
4                     busch gardens tampa bay            TAMPA      NaN  NaN
..                                        ...              ...      ...  ...
134          warner bros abu dhabi, abu dhabi              NaN     0.47   56
135             zhengzhou fantawild adventure        ZHENGZHOU      NaN  NaN
136  zhengzhou fantawild adventure, zhengzhou              NaN      1.2   26
137             zigong fantawild dino kingdom           ZIGONG      NaN  NaN
138     zigong fantawild dino kingdom, zigong              NaN     1.31   23

[139 rows x 4 columns]

In [15]:
# Ordenar por 'Share' de mayor a menor
ordenado = parques.sort_values(by='share, %', ascending=False)

# Quedarte con las primeras 10 filas (top 10)
top10_paises = ordenado.head(10).reset_index(drop=True)

In [16]:
top10_paises

,Nombre del Parque,Ubicación (País),"share, %",Rank
0,object,Desconocido,"share, %",Rank
1,magic kingdom theme park at walt disney world ...,NaN,4.79,1
2,"disneyland park at disneyland resort, anaheim",NaN,4.66,2
3,"universal studios japan, osaka",NaN,4.33,3
4,"tokyo disneyland at tokyo disney resort, tokyo",NaN,4.08,4
5,"shanghai disneyland at shanghai disney resort,...",NaN,3.79,5
6,"chimelong ocean kingdom, hengqin",NaN,3.38,6
7,"tokyo disneysea at tokyo disney resort, tokyo",NaN,3.35,7
8,"epcot at walt disney world, lake buena vista",NaN,3.24,8
9,"disneyland park at disneyland paris, marne-la-...",NaN,2.81,9

In [17]:
pip install selenium

Requirement already satisfied: selenium in c:\users\noeli\appdata\local\programs\python\python311\lib\site-packages (4.37.0)
Requirement already satisfied: urllib3[socks]<3.0,>=2.5.0 in c:\users\noeli\appdata\local\programs\python\python311\lib\site-packages (from selenium) (2.5.0)
Requirement already satisfied: trio<1.0,>=0.31.0 in c:\users\noeli\appdata\local\programs\python\python311\lib\site-packages (from selenium) (0.31.0)
Requirement already satisfied: trio-websocket<1.0,>=0.12.2 in c:\users\noeli\appdata\local\programs\python\python311\lib\site-packages (from selenium) (0.12.2)
Requirement already satisfied: certifi>=2025.10.5 in c:\users\noeli\appdata\local\programs\python\python311\lib\site-packages (from selenium) (2025.10.5)
Requirement already satisfied: typing_extensions<5.0,>=4.15.0 in c:\users\noeli\appdata\roaming\python\python311\site-packages (from selenium) (4.15.0)
Requirement already satisfied: websocket-client<2.0,>=1.8.0 in c:\users\noeli\appdata\local\programs\python\python311\lib\site-packages (from selenium) (1.9.0)
Requirement already satisfied: attrs>=23.2.0 in c:\users\noeli\appdata\local\programs\python\python311\lib\site-packages (from trio<1.0,>=0.31.0->selenium) (25.4.0)
Requirement already satisfied: sortedcontainers in c:\users\noeli\appdata\local\programs\python\python311\lib\site-packages (from trio<1.0,>=0.31.0->selenium) (2.4.0)
Requirement already satisfied: idna in c:\users\noeli\appdata\local\programs\python\python311\lib\site-packages (from trio<1.0,>=0.31.0->selenium) (2.10)
Requirement already satisfied: outcome in c:\users\noeli\appdata\local\programs\python\python311\lib\site-packages (from trio<1.0,>=0.31.0->selenium) (1.3.0.post0)
Requirement already satisfied: sniffio>=1.3.0 in c:\users\noeli\appdata\local\programs\python\python311\lib\site-packages (from trio<1.0,>=0.31.0->selenium) (1.3.1)
Requirement already satisfied: cffi>=1.14 in c:\users\noeli\appdata\local\programs\python\python311\lib\site-packages (from trio<1.0,>=0.31.0->selenium) (2.0.0)
Requirement already satisfied: wsproto>=0.14 in c:\users\noeli\appdata\local\programs\python\python311\lib\site-packages (from trio-websocket<1.0,>=0.12.2->selenium) (1.2.0)
Requirement already satisfied: pysocks!=1.5.7,<2.0,>=1.5.6 in c:\users\noeli\appdata\local\programs\python\python311\lib\site-packages (from urllib3[socks]<3.0,>=2.5.0->selenium) (1.7.1)
Requirement already satisfied: pycparser in c:\users\noeli\appdata\local\programs\python\python311\lib\site-packages (from cffi>=1.14->trio<1.0,>=0.31.0->selenium) (2.23)
Requirement already satisfied: h11<1,>=0.9.0 in c:\users\noeli\appdata\local\programs\python\python311\lib\site-packages (from wsproto>=0.14->trio-websocket<1.0,>=0.12.2->selenium) (0.9.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip available: 22.3 -> 25.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [19]:
import requests
from bs4 import BeautifulSoup
import pandas as pd

url = "https://blog.europa.jobs/es/art-salario-minimo-en-europa-en-2025/"

response = requests.get(url)
response.raise_for_status()

soup = BeautifulSoup(response.text, 'html.parser')

# Encontrar todas las tablas de la página
tables = soup.find_all('table')
print(f"Se encontraron {len(tables)} tablas.")

dfs = []

for i, table in enumerate(tables):
    rows = table.find_all('tr')
    
    # Obtener encabezados si existen
    headers = [th.get_text(strip=True) for th in rows[0].find_all(['th', 'td'])]
    
    data = []
    for row in rows[1:]:
        cols = row.find_all('td')
        if len(cols) == 0:
            continue
        data.append([col.get_text(strip=True) for col in cols])
    
    salario_minimo = pd.DataFrame(data, columns=headers)
    dfs.append(salario_minimo)
    
  

# Ahora dfs es una lista con todos los DataFrames de cada tabla

Se encontraron 4 tablas.

In [20]:
dfs[0]

    Grupo I     Salario mínimo
0  Bulgaria         550,66 EUR
1   Hungría  773,90/883,82 EUR
2   Letonia            740 EUR

In [21]:
dfs[0].rename(columns={
    "Grupo I":"País",
}, inplace=True)

In [22]:
dfs[1]

          Grupo II Salario mínimo
0          Rumanía     814,49 EUR
1           Grecia        968 EUR
2          Croacia        970 EUR
3  República Checa      823,3 EUR
4          Estonia        886 EUR
5            Malta     961,05 EUR
6       Eslovaquia        816 EUR

In [23]:
dfs[1].rename(columns={
    "Grupo II":"País",
}, inplace=True)

In [24]:
dfs[2]

   Grupo III Salario mínimo
0    Polonia    1085,57 EUR
1   Portugal       1015 EUR
2   Lituania       1038 EUR
3  Eslovenia    1253,36 EUR
4     España       1323 EUR
5    Francia    1801,80 EUR

In [25]:
dfs[2].rename(columns={
    "Grupo III":"País",
}, inplace=True)

In [26]:
dfs[3]

       Grupo IV Salario mínimo
0      Alemania       2222 EUR
1       Bélgica    2029,88 EUR
2  Países Bajos       2437 EUR
3       Irlanda    2281,50 EUR
4    Luxemburgo    2637,77 EUR

In [27]:
dfs[3].rename(columns={
    "Grupo IV":"País",
}, inplace=True)

In [28]:
salario_minimo_europa = pd.concat(dfs, ignore_index=True, sort=False)

In [29]:
salario_minimo_europa

               País     Salario mínimo
0          Bulgaria         550,66 EUR
1           Hungría  773,90/883,82 EUR
2           Letonia            740 EUR
3           Rumanía         814,49 EUR
4            Grecia            968 EUR
5           Croacia            970 EUR
6   República Checa          823,3 EUR
7           Estonia            886 EUR
8             Malta         961,05 EUR
9        Eslovaquia            816 EUR
10          Polonia        1085,57 EUR
11         Portugal           1015 EUR
12         Lituania           1038 EUR
13        Eslovenia        1253,36 EUR
14           España           1323 EUR
15          Francia        1801,80 EUR
16         Alemania           2222 EUR
17          Bélgica        2029,88 EUR
18     Países Bajos           2437 EUR
19          Irlanda        2281,50 EUR
20       Luxemburgo        2637,77 EUR

In [30]:
salario_minimo_europa = salario_minimo_europa.sort_values(by="País", ascending=True)

In [31]:
salario_minimo_europa

               País     Salario mínimo
16         Alemania           2222 EUR
0          Bulgaria         550,66 EUR
17          Bélgica        2029,88 EUR
5           Croacia            970 EUR
9        Eslovaquia            816 EUR
13        Eslovenia        1253,36 EUR
14           España           1323 EUR
7           Estonia            886 EUR
15          Francia        1801,80 EUR
4            Grecia            968 EUR
1           Hungría  773,90/883,82 EUR
19          Irlanda        2281,50 EUR
2           Letonia            740 EUR
12         Lituania           1038 EUR
20       Luxemburgo        2637,77 EUR
8             Malta         961,05 EUR
18     Países Bajos           2437 EUR
10          Polonia        1085,57 EUR
11         Portugal           1015 EUR
6   República Checa          823,3 EUR
3           Rumanía         814,49 EUR

In [32]:
# 1. Limpiar la columna de salarios (si tiene símbolos o texto como €)
salario_minimo_europa['Salario mínimo'] = (
    salario_minimo_europa['Salario mínimo']
    .str.replace(r'[^\d,.-]', '', regex=True)   # elimina € u otros caracteres
    .str.replace(',', '.')                     # cambia coma decimal por punto
)

# 2. Convertir a float (forzamos errores como NaN si hay algo raro)
salario_minimo_europa['Salario mínimo'] = pd.to_numeric(salario_minimo_europa['Salario mínimo'], errors='coerce')

# 3. Ordenar de mayor a menor
último_salario = salario_minimo_europa.sort_values(by='Salario mínimo', ascending=False)

In [33]:
último_salario

               País  Salario mínimo
20       Luxemburgo         2637.77
18     Países Bajos         2437.00
19          Irlanda         2281.50
16         Alemania         2222.00
17          Bélgica         2029.88
15          Francia         1801.80
14           España         1323.00
13        Eslovenia         1253.36
10          Polonia         1085.57
12         Lituania         1038.00
11         Portugal         1015.00
5           Croacia          970.00
4            Grecia          968.00
8             Malta          961.05
7           Estonia          886.00
6   República Checa          823.30
9        Eslovaquia          816.00
3           Rumanía          814.49
2           Letonia          740.00
0          Bulgaria          550.66
1           Hungría             NaN

In [34]:
top_10_salario = último_salario.head(10)

In [35]:
top_10_salario

            País  Salario mínimo
20    Luxemburgo         2637.77
18  Países Bajos         2437.00
19       Irlanda         2281.50
16      Alemania         2222.00
17       Bélgica         2029.88
15       Francia         1801.80
14        España         1323.00
13     Eslovenia         1253.36
10       Polonia         1085.57
12      Lituania         1038.00

In [36]:
import requests
from bs4 import BeautifulSoup
import pandas as pd

# URL de la página que quieres extraer
url = "https://datosmacro.expansion.com/paises/grupos/zona-euro"

# Realizar la petición HTTP
resp = requests.get(url)
resp.raise_for_status()  # asegurarnos que la petición fue exitosa

# Parsear con BeautifulSoup
soup = BeautifulSoup(resp.text, 'html.parser')

# Encontrar la tabla (o las tablas) relevantes
# Aquí suponemos que la tabla está identificada como <table>
tables = soup.find_all('table')
print(f"Se han encontrado {len(tables)} tablas en la página.")

# Supongamos que la tabla que quieres es la primera
table = tables[0]

# Extraer los encabezados
header_cells = table.find('thead').find_all('th')
headers = [cell.get_text(strip=True) for cell in header_cells]

# Extraer las filas de datos
data = []
for row in table.find('tbody').find_all('tr'):
    cols = row.find_all('td')
    if not cols:
        continue
    data.append([col.get_text(strip=True) for col in cols])

# Crear un DataFrame con pandas
pais_poblacion = pd.DataFrame(data, columns=headers)

# Ver el DataFrame resultante
print(pais_poblacion.head())

Se han encontrado 1 tablas en la página.
         Países   Población     PIB anual     PIB anual PIB Per Capita  \
0  Alemania [+]  83.577.140  4.328.970 M€  4.685.593 M$       51.830 €
1   Austria [+]   9.197.213    494.088 M€    534.791 M$       53.830 €
2   Bélgica [+]  11.900.123    620.272 M€    664.564 M$       52.370 €
3    Chipre [+]     979.865     33.568 M€     36.322 M$       35.730 €
4   Croacia [+]   3.874.350     85.905 M€     92.982 M$       22.200 €

  PIB Per Capita    IDH Deuda total (M.€) Deuda total (M.$) Deuda (%PIB)  \
0       56.087 $  0,950         2.688.879         2.972.835       62,50%
1       57.208 $  0,926           394.131           423.300       81,80%
2       56.221 $  0,942           642.875           695.626      104,70%
3       38.802 $  0,907            21.828            23.640       65,00%
4       24.025 $  0,878            49.283            53.327       57,60%

  Déficit (%PIB)
0         -2,80%
1         -4,70%
2         -4,50%
3          4,30%
4         -2,40%

In [50]:
pais_poblacion["Países"] = pais_poblacion["Países"].str.replace("[+]", "", regex=False)

In [51]:
pais_poblacion

,Países,Población,PIB anual,PIB anual,PIB Per Capita,PIB Per Capita,IDH,Deuda total (M.€),Deuda total (M.$)
0,Alemania,83.577.140,4.328.970 M€,4.685.593 M$,51.830 €,56.087 $,"0,950",2.688.879,2.972.835
1,Austria,9.197.213,494.088 M€,534.791 M$,53.830 €,57.208 $,"0,926",394.131,423.300
2,Bélgica,11.900.123,620.272 M€,664.564 M$,52.370 €,56.221 $,"0,942",642.875,695.626
3,Chipre,979.865,33.568 M€,36.322 M$,35.730 €,38.802 $,"0,907",21.828,23.640
4,Croacia,3.874.350,85.905 M€,92.982 M$,22.200 €,24.025 $,"0,878",49.283,53.327
5,Eslovaquia,5.419.451,130.208 M€,141.776 M$,23.850 €,26.127 $,"0,855",77.648,81.118
6,Eslovenia,2.130.850,67.418 M€,72.972 M$,31.700 €,34.346 $,"0,926",44.895,48.579
7,España,49.315.949,1.594.330 M€,1.725.672 M$,32.630 €,35.151 $,"0,911",1.620.573,1.753.580
8,Estonia,1.369.995,39.848 M€,43.130 M$,28.990 €,31.419 $,"0,899",9.327,10.092
9,Finlandia,5.635.971,275.963 M€,298.697 M$,49.100 €,53.286 $,"0,942",226.701,245.304
10,Francia,68.635.943,2.921.412 M€,3.160.443 M$,42.630 €,46.187 $,"0,910",3.305.287,3.576.501
11,Grecia,10.409.547,236.736 M€,256.238 M$,22.480 €,24.716 $,"0,893",364.885,397.919
12,Irlanda,5.439.898,562.794 M€,609.157 M$,104.510 €,112.356 $,"0,950",218.178,236.081
13,Italia,58.934.177,2.199.619 M€,2.380.825 M$,37.310 €,40.224 $,"0,906",2.966.597,3.210.019
14,Letonia,1.856.932,40.359 M€,43.684 M$,21.640 €,23.243 $,"0,879",18.800,20.343
15,Lituania,2.890.664,78.996 M€,84.869 M$,27.350 €,29.379 $,"0,879",29.972,32.431
16,Luxemburgo,681.973,86.180 M€,93.280 M$,127.030 €,138.757 $,"0,927",22.654,24.514
17,Malta,574.250,23.071 M€,24.964 M$,40.530 €,45.167 $,"0,915",10.648,11.527
18,Países Bajos,18.044.027,1.122.459 M€,1.214.928 M$,62.380 €,67.690 $,"0,946",491.585,531.922
19,Portugal,10.749.635,289.428 M€,313.271 M$,27.060 €,28.887 $,"0,874",270.723,292.937
20,~TOTAL: Zona Euro,351.617.953,15.231.624 M€,16.478.158 M$,43.319 €,46.864 $,,13.475.469,14.641.594

In [56]:
pais_poblacion.drop(columns=['PIB anual', 'PIB anual', 'PIB Per Capita', 'PIB Per Capita', 'IDH', 'Deuda total (M.€)', 'Deuda total (M.$)'], inplace=True)

In [57]:
pais_poblacion

               Países    Población
0           Alemania    83.577.140
1            Austria     9.197.213
2            Bélgica    11.900.123
3             Chipre       979.865
4            Croacia     3.874.350
5         Eslovaquia     5.419.451
6          Eslovenia     2.130.850
7             España    49.315.949
8            Estonia     1.369.995
9          Finlandia     5.635.971
10           Francia    68.635.943
11            Grecia    10.409.547
12           Irlanda     5.439.898
13            Italia    58.934.177
14           Letonia     1.856.932
15          Lituania     2.890.664
16        Luxemburgo       681.973
17             Malta       574.250
18      Países Bajos    18.044.027
19          Portugal    10.749.635
20  ~TOTAL: Zona Euro  351.617.953

In [58]:
pais_poblacion.rename(columns={
    "Países": "País",
}, inplace=True)

In [59]:
import unicodedata

def limpiar_pais(nombre):
    return (
        str(nombre)
        .strip()  # quita espacios al inicio/final
        .replace("+", "")  # elimina '+'
        .replace("\xa0", " ")  # reemplaza espacio no separable
        .lower()  # todo minúsculas
        .title()  # primera letra en mayúscula
        .replace("’", "'")  # comillas raras
        .replace("´", "'")  # tildes incorrectas
        .replace(",", "")  # elimina comas
        .replace(".", "")  # elimina puntos
    )

# Aplicar a ambos
salario_minimo_europa["País"] = salario_minimo_europa["País"].apply(limpiar_pais)
pais_poblacion["País"] = pais_poblacion["País"].apply(limpiar_pais)

In [60]:
poblacion_salario = pd.merge(salario_minimo_europa, pais_poblacion, on="País", how="outer")
poblacion_salario = poblacion_salario.groupby("País").agg({
    "Salario mínimo": "first",
    "Población": "first"
}).reset_index()

In [61]:
poblacion_salario = poblacion_salario.sort_values(by="Salario mínimo", ascending=False)

In [62]:
top_poblacion_salario = poblacion_salario.head(15)

In [63]:
top_poblacion_salario

            País  Salario mínimo   Población
18    Luxemburgo         2637.77     681.973
20  Países Bajos         2437.00  18.044.027
14       Irlanda         2281.50   5.439.898
0       Alemania         2222.00  83.577.140
3        Bélgica         2029.88  11.900.123
11       Francia         1801.80  68.635.943
8         España         1323.00  49.315.949
7      Eslovenia         1253.36   2.130.850
21       Polonia         1085.57        None
17      Lituania         1038.00   2.890.664
22      Portugal         1015.00  10.749.635
5        Croacia          970.00   3.874.350
12        Grecia          968.00  10.409.547
19         Malta          961.05     574.250
9        Estonia          886.00   1.369.995

In [64]:
import pandas as pd

# Datos de los parques de atracciones
data = {
    "Parque Temático": [
        "Disneyland Park Paris",
        "Europa-Park",
        "Walt Disney Studios Park",
        "De Efteling",
        "Tivoli Gardens",
        "PortAventura World",
        "Gardaland",
        "Parc Astérix",
        "Puy du Fou",
        "Legoland Windsor",
        "Alton Towers",
        "Legoland Billund",
        "Liseberg"
    ],
    "País": [
        "Francia",
        "Alemania",
        "Francia",
        "Países Bajos",
        "Dinamarca",
        "España",
        "Italia",
        "Francia",
        "Francia",
        "Reino Unido",
        "Reino Unido",
        "Dinamarca",
        "Suecia"
    ],
    "Visitantes (millones)": [
        10.4,
        6.0,
        5.7,
        5.56,
        4.03,
        3.98,
        3.07,
        2.81,
        2.5,
        2.42,
        2.35,
        2.35,
        2.3
    ]
}

# Crear DataFrame
parques_europa= pd.DataFrame(data)

# Guardar en archivo CSV
parques_europa.to_csv("parques_atracciones_europa.csv", index=False)

print("Archivo 'parques_atracciones_europa.csv' creado correctamente.")

Archivo 'parques_atracciones_europa.csv' creado correctamente.

In [65]:
parques_europa

             Parque Temático          País  Visitantes (millones)
0      Disneyland Park Paris       Francia                  10.40
1                Europa-Park      Alemania                   6.00
2   Walt Disney Studios Park       Francia                   5.70
3                De Efteling  Países Bajos                   5.56
4             Tivoli Gardens     Dinamarca                   4.03
5         PortAventura World        España                   3.98
6                  Gardaland        Italia                   3.07
7               Parc Astérix       Francia                   2.81
8                 Puy du Fou       Francia                   2.50
9           Legoland Windsor   Reino Unido                   2.42
10              Alton Towers   Reino Unido                   2.35
11          Legoland Billund     Dinamarca                   2.35
12                  Liseberg        Suecia                   2.30

In [69]:
parques_completo = pd.merge(top_poblacion_salario, parques_europa, on="País", how="outer")
parques_completo = parques_completo.groupby("País").agg({
    "Población": "first",
    "Salario mínimo": "first",
    "Parque Temático": "first",
    "Visitantes (millones)": "first"
}).reset_index()

In [70]:
parques_completo

,País,Población,Salario mínimo,Parque Temático,Visitantes (millones)
0,Alemania,83.577.140,2222.00,Europa-Park,6.00
1,Bélgica,11.900.123,2029.88,None,NaN
2,Croacia,3.874.350,970.00,None,NaN
3,Dinamarca,None,NaN,Tivoli Gardens,4.03
4,Eslovenia,2.130.850,1253.36,None,NaN
5,España,49.315.949,1323.00,PortAventura World,3.98
6,Estonia,1.369.995,886.00,None,NaN
7,Francia,68.635.943,1801.80,Disneyland Park Paris,10.40
8,Grecia,10.409.547,968.00,None,NaN
9,Irlanda,5.439.898,2281.50,None,NaN
10,Italia,None,NaN,Gardaland,3.07
11,Lituania,2.890.664,1038.00,None,NaN
12,Luxemburgo,681.973,2637.77,None,NaN
13,Malta,574.250,961.05,None,NaN
14,Países Bajos,18.044.027,2437.00,De Efteling,5.56
15,Polonia,None,1085.57,None,NaN
16,Portugal,10.749.635,1015.00,None,NaN
17,Reino Unido,None,NaN,Legoland Windsor,2.42
18,Suecia,None,NaN,Liseberg,2.30

In [109]:
import pandas as pd

ruta = 'C:/Users/noeli/Downloads/xls0009914_i.csv'

menores_15 = pd.read_csv(
    ruta,
    sep=';',
    encoding='latin1',
    skiprows=4  # ajustar si es necesario
)

print(menores_15.head())
print(menores_15.columns)

      EU 27  15,4 15,4.1  15,3 15,3.1 15,3.2  15,2 15,2.1 15,2.2  15,1    15  \
0   Germany  13,4   13,3  13,2   13,2   13,2  13,4   13,5   13,6  13,7  13,8
1   Austria  14,6   14,4  14,3   14,3   14,3  14,4   14,4   14,4  14,4  14,4
2   Belgium    17     17    17     17     17    17     17   16,9  16,9  16,8
3  Bulgaria  13,4   13,6  13,7   13,9     14  14,1   14,2   14,4  14,4  14,4
4    Cyprus  16,5   16,4  16,3   16,4   16,4  16,3   16,2   16,1    16    16

   15.1  14,9  Unnamed: 13
0  13,9  14,1          NaN
1  14,4  14,4          NaN
2  16,6  16,5          NaN
3  14,5  14,2          NaN
4  16,1  16,1          NaN
Index(['EU 27', '15,4', '15,4.1', '15,3', '15,3.1', '15,3.2', '15,2', '15,2.1',
       '15,2.2', '15,1', '15', '15.1', '14,9', 'Unnamed: 13'],
      dtype='object')

In [110]:
menores_15 = menores_15.rename(columns={"14,9": "Menores 15(%)"})
menores_15 = menores_15.rename(columns={"EU 27": "País"})
menores_15.drop(columns=["15,2.1", "15,2.2", "15,1", "15", "15.1"], inplace=True)
menores_15.drop(columns=["15,4", "15,4.1", "15,3", "15,3.1", "15,3.2", "15,2"], inplace=True)
menores_15.drop(columns=["Unnamed: 13"],inplace=True)

In [111]:
pip install googletrans==4.0.0-rc1

Requirement already satisfied: googletrans==4.0.0-rc1 in c:\users\noeli\appdata\local\programs\python\python311\lib\site-packages (4.0.0rc1)
Requirement already satisfied: httpx==0.13.3 in c:\users\noeli\appdata\local\programs\python\python311\lib\site-packages (from googletrans==4.0.0-rc1) (0.13.3)
Requirement already satisfied: certifi in c:\users\noeli\appdata\local\programs\python\python311\lib\site-packages (from httpx==0.13.3->googletrans==4.0.0-rc1) (2025.10.5)
Requirement already satisfied: hstspreload in c:\users\noeli\appdata\local\programs\python\python311\lib\site-packages (from httpx==0.13.3->googletrans==4.0.0-rc1) (2025.1.1)
Requirement already satisfied: sniffio in c:\users\noeli\appdata\local\programs\python\python311\lib\site-packages (from httpx==0.13.3->googletrans==4.0.0-rc1) (1.3.1)
Requirement already satisfied: chardet==3.* in c:\users\noeli\appdata\local\programs\python\python311\lib\site-packages (from httpx==0.13.3->googletrans==4.0.0-rc1) (3.0.4)
Requirement already satisfied: idna==2.* in c:\users\noeli\appdata\local\programs\python\python311\lib\site-packages (from httpx==0.13.3->googletrans==4.0.0-rc1) (2.10)
Requirement already satisfied: rfc3986<2,>=1.3 in c:\users\noeli\appdata\local\programs\python\python311\lib\site-packages (from httpx==0.13.3->googletrans==4.0.0-rc1) (1.5.0)
Requirement already satisfied: httpcore==0.9.* in c:\users\noeli\appdata\local\programs\python\python311\lib\site-packages (from httpx==0.13.3->googletrans==4.0.0-rc1) (0.9.1)
Requirement already satisfied: h11<0.10,>=0.8 in c:\users\noeli\appdata\local\programs\python\python311\lib\site-packages (from httpcore==0.9.*->httpx==0.13.3->googletrans==4.0.0-rc1) (0.9.0)
Requirement already satisfied: h2==3.* in c:\users\noeli\appdata\local\programs\python\python311\lib\site-packages (from httpcore==0.9.*->httpx==0.13.3->googletrans==4.0.0-rc1) (3.2.0)
Requirement already satisfied: hyperframe<6,>=5.2.0 in c:\users\noeli\appdata\local\programs\python\python311\lib\site-packages (from h2==3.*->httpcore==0.9.*->httpx==0.13.3->googletrans==4.0.0-rc1) (5.2.0)
Requirement already satisfied: hpack<4,>=3.0 in c:\users\noeli\appdata\local\programs\python\python311\lib\site-packages (from h2==3.*->httpcore==0.9.*->httpx==0.13.3->googletrans==4.0.0-rc1) (3.0.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip available: 22.3 -> 25.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [112]:
from googletrans import Translator
import pandas as pd

translator = Translator()

# Supongamos que df es tu DataFrame y 'column_name' la columna en inglés
menores_15['País'] = menores_15['País'].apply(lambda x: translator.translate(x, src='en', dest='es').text)

In [113]:
parques_menores15 = pd.merge(parques_completo, menores_15, on='País', how='inner')
col = 'Menores 15(%)'
pos = 2  # posición deseada (0 = primera columna)

cols = list(parques_menores15.columns)
cols.insert(pos, cols.pop(cols.index(col)))  # mueve la columna

parques_menores15 = parques_menores15[cols]

In [114]:
parques_menores15

,País,Población,Menores 15(%),Salario mínimo,Parque Temático,Visitantes (millones)
0,Alemania,83.577.140,"14,1",2222.00,Europa-Park,6.00
1,Bélgica,11.900.123,"16,5",2029.88,None,NaN
2,Croacia,3.874.350,"14,3",970.00,None,NaN
3,Dinamarca,None,16,NaN,Tivoli Gardens,4.03
4,Eslovenia,2.130.850,15,1253.36,None,NaN
5,España,49.315.949,"13,6",1323.00,PortAventura World,3.98
6,Estonia,1.369.995,"16,4",886.00,None,NaN
7,Francia,68.635.943,"17,3",1801.80,Disneyland Park Paris,10.40
8,Grecia,10.409.547,"13,4",968.00,None,NaN
9,Irlanda,5.439.898,"19,3",2281.50,None,NaN
10,Italia,None,"12,4",NaN,Gardaland,3.07
11,Lituania,2.890.664,"14,9",1038.00,None,NaN
12,Luxemburgo,681.973,"15,9",2637.77,None,NaN
13,Malta,574.250,"12,7",961.05,None,NaN
14,Países Bajos,18.044.027,"15,3",2437.00,De Efteling,5.56
15,Polonia,None,"15,4",1085.57,None,NaN
16,Portugal,10.749.635,"12,9",1015.00,None,NaN
17,Suecia,None,"17,4",NaN,Liseberg,2.30